jpat-transfer-logs/src/main/resources/openshift/templates/request.vm

   <soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:sch="http://itau.com.co/services/accounts/transactionfee/v1/definitions/schemas" xmlns:sch1="http://itau.com.co/commoncannonical/v2/schemas">
   <soapenv:Header/>
   <soapenv:Body>
      <sch:modTransferTransactionLogRq>
         <sch:HeaderRequest>
            <!--Optional:-->
            <sch1:MessageHeader>
               <!--Optional:-->
               <sch1:MessageKey>
                  <!--Optional:-->
                  <sch1:integrationId>$!{headers.integrationId}</sch1:integrationId>
                  <!--Optional:-->
                  <sch1:requestVersion>$!{headers.requestVersion}</sch1:requestVersion>
                  <sch1:requestUUID>$!{headers.requestUUID}</sch1:requestUUID>
               </sch1:MessageKey>
               <!--Optional:-->
               <sch1:MessageInfo>
                  <sch1:dateTime>$!{headers.dateTime}</sch1:dateTime>
                  <sch1:systemId>$!{headers.systemId}</sch1:systemId>
                  <!--Optional:-->
                  <sch1:originatorName>$!{headers.originatorName}</sch1:originatorName>
                  <sch1:originatorType>$!{headers.originatorType}</sch1:originatorType>
                  <sch1:terminalId>$!{headers.terminalId}</sch1:terminalId>
                  <!--Optional:-->
                  <sch1:terminalType>$!{headers.terminalType}</sch1:terminalType>
                  <!--Optional:-->
                  <sch1:bankIdType>$!{headers.bankIdType}</sch1:bankIdType>
                  <!--Optional:-->
                  <sch1:bankId>$!{headers.bankId}</sch1:bankId>
                  <!--Optional:-->
                  <sch1:trnType>$!{headers.trnType}</sch1:trnType>
               </sch1:MessageInfo>
               <!--Optional:-->
               <sch1:TrnInfoList>
                  <!--Zero or more repetitions:-->
                  <sch1:TrnInfo>
                     <!--Optional:-->
                     <sch1:trnCode>$!{headers.trnCode}</sch1:trnCode>
                     <!--Optional:-->
                     <sch1:trnSrc>$!{headers.trnSrc}</sch1:trnSrc>
                  </sch1:TrnInfo>
               </sch1:TrnInfoList>
            </sch1:MessageHeader>
            <!--Optional:-->
            <sch1:User>
               <!--Optional:-->
               <sch1:userName>$!{headers.userName}</sch1:userName>
               <!--Optional:-->
               <sch1:userToken/>
               <!--Optional:-->
               <sch1:employeeIdentlNum>$!{headers.employeeIdentlNum}</sch1:employeeIdentlNum>
            </sch1:User>
         </sch:HeaderRequest>
         <!--Optional:-->
         <sch:ownerInd>$!{ownerInd}</sch:ownerInd>
         <sch:trnCategory>$!{ownerInd}</sch:trnCategory>
         <sch:trnCode>$!{ownerInd}</sch:trnCode>
         <!--Optional:-->
         <sch:ReferenceInfo>
            <!--Optional:-->
            <sch:referenceID
            >$!{headers.trnId}</sch:referenceID>
            <!--Optional:-->
            <sch:trnType>$!{headers.trnType}</sch:trnType>
            <!--Optional:-->
            <sch:trnSubType>$!{headers.trnSubType}</sch:trnSubType>
            <!--Optional:-->
            <sch:trnCode>$!{headers.trnCode}</sch:trnCode>
            <!--Optional:-->
            <sch:trnCodeRev>$!{headers.trnCodeRev}</sch:trnCodeRev>
            <!--Optional:-->
            <sch:TrnStatus>
               <sch:trnStatusCode>$!{headers.trnStatusCode}</sch:trnStatusCode>
               <sch:trnStatusDesc>$!{headers.trnStatusDesc}</sch:trnStatusDesc>
               <sch:trnStatusReason>$!{headers.trnStatusReason}</sch:trnStatusReason>
            </sch:TrnStatus>
            <!--Optional:-->
            <sch:effDt>$!{headers.effDt}</sch:effDt>
         </sch:ReferenceInfo>
         <sch:CustId>
            <!--Optional:-->
            <sch1:SPName/>
            <!--Optional:-->
            <sch1:custPermId>$!{headers.custPermId}</sch1:custPermId>
            <!--Optional:-->
            <sch1:custLoginId/>
            <!--Optional:-->
            <sch1:custType>$!{headers.custType}</sch1:custType>
         </sch:CustId>
         <!--Optional:-->
         <sch:BenefitName>
            <!--Optional:-->
            <sch1:fullName>$!{headers.fullName}</sch1:fullName>
            <!--Optional:-->
            <sch1:firstName/>
            <!--Optional:-->
            <sch1:middleName/>
            <!--Optional:-->
            <sch1:lastName/>
            <!--Optional:-->
            <sch1:motherMaidenName/>
         </sch:BenefitName>
         <!--Optional:-->
         <sch:Acct>
            <sch1:acctId>$!{headers.acctId}</sch1:acctId>
            <!--Optional:-->
            <sch1:acctType>$!{headers.acctType}</sch1:acctType>
            <!--Optional:-->
            <sch1:acctSubType/>
            <!--Optional:-->
            <sch1:branchId/>
         </sch:Acct>
         <!--Optional:-->
         <sch:FromPhoneNum>
            <!--Optional:-->
            <sch1:phoneType/>
            <sch1:phone>$!{headers.fromPhone}</sch1:phone>
         </sch:FromPhoneNum>
         <!--Optional:-->
         <sch:ToPhoneNum>
            <!--Optional:-->
            <sch1:phoneType/>
            <sch1:phone>$!{headers.toPhone}</sch1:phone>
         </sch:ToPhoneNum>
         <!--Optional:-->
         <sch:amt>$!{headers.amt}</sch:amt>
         <!--Optional:-->
         <sch:Device>
            <!--Optional:-->
            <sch:hash>$!{headers.hash}</sch:hash>
            <!--Optional:-->
            <sch:brand>$!{headers.brand}</sch:brand>
            <!--Optional:-->
            <sch:country>$!{headers.country}</sch:country>
            <!--Optional:-->
            <sch:city>$!{headers.city}</sch:city>
            <!--Optional:-->
            <sch:model>$!{headers.model}</sch:model>
            <!--Optional:-->
            <sch:imsi>$!{headers.imsi}</sch:imsi>
            <!--Optional:-->
            <sch:geolocation>$!{headers.geolocation}</sch:geolocation>
            <!--Optional:-->
            <sch:carrierName>$!{headers.carrierName}</sch:carrierName>
         </sch:Device>
      </sch:modTransferTransactionLogRq>
   </soapenv:Body>
</soapenv:Envelope>